PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_ipc_pipe.c
/***************************************************************************//**
* \file cy_ipc_pipe.c
* \version 1.140
*
*  Description:
*   IPC Pipe Driver - This source file includes code for the Pipe layer on top
*   of the IPC driver.
*
********************************************************************************
* Copyright 2016-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS) || defined (CY_IP_MXIPC)

#include "cy_ipc_pipe.h"

/* Define a pointer to array of endPoints.
*  ( This comprises of all channels present in all IPC IP instances. ) */
static cy_stc_ipc_pipe_ep_t *cy_ipc_pipe_epArray = NULL;
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 12, \
                             'Intentional typecast to IRQn_Type enum.')

/*******************************************************************************
* Function Name: Cy_IPC_Pipe_Config
****************************************************************************//**
*
* This function stores a copy of a pointer to the array of endpoints.  All
* access to endpoints will be via the index of the endpoint in this array.
*
* \note In general case, this function is called in the default startup code,
* so user doesn't need to call it anywhere.
* However, it may be useful in case of some pipe customizations.
*
* \param theEpArray
* This is the pointer to an array of endpoint structures that the designer
* created and will be used to reference all endpoints.
*
* \funcusage
* \snippet ipc/snippet/main.c snippet_myIpcPipeEpArray
* \snippet ipc/snippet/main.c snippet_Cy_IPC_Pipe_Config
*
*******************************************************************************/
void Cy_IPC_Pipe_Config(cy_stc_ipc_pipe_ep_t * theEpArray)
{
    /* Keep copy of this endpoint */
    if (cy_ipc_pipe_epArray == NULL)
    {
        cy_ipc_pipe_epArray = theEpArray;
    }
}


/*******************************************************************************
* Function Name: Cy_IPC_Pipe_Init
****************************************************************************//**
*
* Initializes the system pipes. The system pipes are used by BLE.
* \note The function should be called on all CPUs.
*
* \note In general case, this function is called in the default startup code,
* so user doesn't need to call it anywhere.
* However, it may be useful in case of some pipe customizations.
*
* \param config
* This is the pointer to the pipe configuration structure
*
* \funcusage
* \snippet ipc/snippet/main.c snippet_myIpcPipeCbArray
* \snippet ipc/snippet/main.c snippet_myIpcPipeEpConfig
* \snippet ipc/snippet/main.c snippet_Cy_IPC_Pipe_Init
*
*******************************************************************************/
void Cy_IPC_Pipe_Init(cy_stc_ipc_pipe_config_t const *config)
{
    /* Create the interrupt structures and arrays needed */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Intentional typecast to IRQn_Type.');
    cy_stc_sysint_t                 ipc_intr_cypipeConfig = {.intrSrc = (IRQn_Type)0U, .intrPriority = 0U};

    cy_stc_ipc_pipe_ep_config_t        epConfigDataA;
    cy_stc_ipc_pipe_ep_config_t        epConfigDataB;

    /* Parameters checking begin */
    CY_ASSERT_L1(NULL != config);
#if (CY_CPU_CORTEX_M0P)
    CY_ASSERT_L2((uint32_t)(1UL << __NVIC_PRIO_BITS) > config->ep0ConfigData.ipcNotifierPriority);
#else
    CY_ASSERT_L2((uint32_t)(1UL << __NVIC_PRIO_BITS) > config->ep1ConfigData.ipcNotifierPriority);
#endif
    CY_ASSERT_L1(NULL != config->endpointsCallbacksArray);
    CY_ASSERT_L1(NULL != config->userPipeIsrHandler);
    /* Parameters checking end */


    /* Receiver endpoint = EP0, Sender endpoint = EP1 */
    epConfigDataA = config->ep0ConfigData;
    epConfigDataB = config->ep1ConfigData;

    /* New Implementation which supports all devices */
#if (CY_IPC_INSTANCES > 1)
    /* Configure CM33 interrupts */
    if (epConfigDataA.ipcNotifierNumber < CY_IPC_IP0_INT)
    {
        ipc_intr_cypipeConfig.intrSrc          = (IRQn_Type)((int32_t)cpuss_interrupts_ipc_0_IRQn +
            (int32_t)epConfigDataA.ipcNotifierNumber);
        ipc_intr_cypipeConfig.intrPriority     = epConfigDataA.ipcNotifierPriority;
    }
#if !(CY_CPU_CORTEX_M0P)
    else if (epConfigDataA.ipcNotifierNumber >= CY_IPC_IP0_INT)
    {
        ipc_intr_cypipeConfig.intrSrc          = (IRQn_Type)((int32_t)cpuss_interrupts_ipc_1_IRQn +
            (int32_t)(epConfigDataA.ipcNotifierNumber - CY_IPC_IP0_INT));
        ipc_intr_cypipeConfig.intrPriority     = epConfigDataA.ipcNotifierPriority;
    }
#endif /* !(CY_CPU_CORTEX_M0P) */
    else
    {
        /* Nothing to do */
    }
#elif defined(CY_IP_M4CPUSS) && (CY_CPU_CORTEX_M0P)
    /* Configure CM0 interrupts */
    ipc_intr_cypipeConfig.intrSrc          = (IRQn_Type)epConfigDataA.ipcNotifierMuxNumber;
    ipc_intr_cypipeConfig.cm0pSrc          = (cy_en_intr_t)((int32_t)cpuss_interrupts_ipc_0_IRQn + (int32_t)epConfigDataA.ipcNotifierNumber);
    ipc_intr_cypipeConfig.intrPriority     = epConfigDataA.ipcNotifierPriority;
#elif defined (CY_IP_M7CPUSS) /* CM7 */
    /* Configure CM0 interrupts */
    ipc_intr_cypipeConfig.intrSrc          = ((epConfigDataA.ipcNotifierMuxNumber << CY_SYSINT_INTRSRC_MUXIRQ_SHIFT) | (uint32_t)((int32_t)cpuss_interrupts_ipc_0_IRQn + (int32_t)epConfigDataA.ipcNotifierNumber));
    ipc_intr_cypipeConfig.intrPriority     = epConfigDataA.ipcNotifierPriority;
#else
    /* Configure interrupts */
    ipc_intr_cypipeConfig.intrSrc          = (IRQn_Type)((int32_t)cpuss_interrupts_ipc_0_IRQn + (int32_t)epConfigDataA.ipcNotifierNumber);
    ipc_intr_cypipeConfig.intrPriority     = epConfigDataA.ipcNotifierPriority;

#endif /* (CY_CPU_CORTEX_M0P && CY_IP_M4CPUSS) */

